public/programming/linux/security-management-solutions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt; <a href="linux.html">Linux</a> &gt; <a href="notes.html">Notes</a> &gt;
</p>
<div id="outline-container-org0739311" class="outline-2">
<h2 id="org0739311">Security Management Solutions</h2>
<div class="outline-text-2" id="text-org0739311">
</div>
<div id="outline-container-orga4e353c" class="outline-3">
<h3 id="orga4e353c">Wazuh</h3>
<div class="outline-text-3" id="text-orga4e353c">
<p>
<a href="https://wazuh.com/">Website</a>. Install wazuh on a docker container:
</p>

<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/wazuh/wazuh-docker.git -b v4.14.2
<span style="color: #b0c4de;">cd</span> wazuh-docker/single-node/
</pre>
</div>

<p>
If you are using SELinux, add a <code>:z</code> after each volume so SELinux does
not complain:
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #eedd82;">volumes</span>:
      - ./config/wazuh_indexer_ssl_certs/:/certificates/:z
      - ./config/certs.yml:/config/certs.yml:z
</pre>
</div>

<p>
First you need to generate the certificate, then you can deploy the
server. Use <code>sudo</code> because the container needs to bind to the network
interface.
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo docker compose -f generate-indexer-certs.yml run --rm generator
sudo docker compose up -d
</pre>
</div>

<p>
You can finally connect to the interface and start using the manager:
</p>

<div class="org-src-container">
<pre class="src src-bash">https://&lt;DOCKER_HOST_IP&gt;
</pre>
</div>

<ul class="org-ul">
<li>Username: <code>admin</code></li>
<li>Password: <code>SecretPassword</code></li>
</ul>

<p>
For configuration, check the file in <code>/var/ossec/etc/ossec.conf</code>.
</p>

<p>
ps: there is a dark mode in Dashboard Management &gt; Advanced Settings.
</p>
</div>
<div id="outline-container-org812e26e" class="outline-4">
<h4 id="org812e26e">Useful panels</h4>
<div class="outline-text-4" id="text-org812e26e">
<ul class="org-ul">
<li>Endpoint security &gt; Configuration Assessment: correct configuration</li>
<li>Threat Intelligence &gt; Vulnerability Detection: CVEs</li>
<li>Thread Intelligence &gt; Threat Hunting: live monitor activity</li>
<li>Security operations &gt; IT Hygene: general overview of the system</li>
</ul>

<hr />

<p>
Travel: <a href="./notes.html">Linux Notes</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
